<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Data Investigation with Pandas

## 1.0 Importing our Libraries

In [ ]:
# Importing the libraries we will need 

# Importing the pandas library
# 
import pandas as pd

# Importing the numpy library
#
import numpy as np

## 1.1 Reading the Dataset from our CSV file



The dataset we will use contains information about the 2009 Census - The Rural Urban Population by Age, Sex and District.


*   Dataset link for download or access: [Link](https://drive.google.com/open?id=1pc9ZLFGsosdWBk1lI29ADIqRtCvD_FBe)

In [ ]:
# Let's read the data from the CSV file and create the dataframe to be used
# 
f = 'Rural_Urban_Population_By_Age_Sex_and_by_District__2009.csv'
df = pd.read_csv(f) 
df
#setting object id as index xolumn
df = pd.read_csv(f, index_col=['OBJECTID'])
df

                 District Urban/Rural Age_years  ...    Total   County     Province
OBJECTID                                         ...
0.0          NAIROBI WEST       Urban         0  ...  20242.0  Nairobi      NAIROBI
1.0          NAIROBI WEST       Urban         1  ...  16113.0  Nairobi      NAIROBI
2.0          NAIROBI WEST       Urban         2  ...  17089.0  Nairobi      NAIROBI
3.0          NAIROBI WEST       Urban         3  ...  16754.0  Nairobi      NAIROBI
4.0          NAIROBI WEST       Urban         4  ...  15768.0  Nairobi      NAIROBI
...                   ...         ...       ...  ...      ...      ...          ...
20174.0   TURKANA CENTRAL       Rural         2  ...   6760.0  Turkana  RIFT VALLEY
20175.0   TURKANA CENTRAL       Rural         3  ...   6773.0  Turkana  RIFT VALLEY
20176.0   TURKANA CENTRAL       Rural         4  ...   7143.0  Turkana  RIFT VALLEY
20177.0   TURKANA CENTRAL       Rural         5  ...   6746.0  Turkana  RIFT VALLEY
NaN        TURKANA CENTRA         NaN       NaN  ...      NaN      NaN          NaN

[20179 rows x 8 columns]

## 1.2 Previewing our Dataset

In [ ]:
# Let's preview the first 10 rows of our data
# 
df.head(10)

              District Urban/Rural Age_years  ...  Total   County  Province
OBJECTID                                      ...
0         NAIROBI WEST       Urban         0  ...  20242  Nairobi   NAIROBI
1         NAIROBI WEST       Urban         1  ...  16113  Nairobi   NAIROBI
2         NAIROBI WEST       Urban         2  ...  17089  Nairobi   NAIROBI
3         NAIROBI WEST       Urban         3  ...  16754  Nairobi   NAIROBI
4         NAIROBI WEST       Urban         4  ...  15768  Nairobi   NAIROBI
5         NAIROBI WEST       Urban         5  ...  15207  Nairobi   NAIROBI
6         NAIROBI WEST       Urban         6  ...  14048  Nairobi   NAIROBI
7         NAIROBI WEST       Urban         7  ...  13185  Nairobi   NAIROBI
8         NAIROBI WEST       Urban         8  ...  12660  Nairobi   NAIROBI
9         NAIROBI WEST       Urban         9  ...  13023  Nairobi   NAIROBI

[10 rows x 8 columns]

## 1.3 Accessing Information about our Dataset

In [ ]:
# We can getting to know more about the dataset by accessing its information 
#
#accessing maximum total population
df['Total'].max()

#accessing min total population
df['Total'].min()

#statistics about total population
df['Total'].describe()

#Urban Pop
u_pop = df['Total'].groupby(df['Urban/Rural'])
u_pop.mean()
u_pop.sum()

Urban/Rural
0               0
80          24800
Rural    25804256
Urban    12401054
Name: Total, dtype: int64

## 1.4 Answering Questions

Let's answer the following questions with our dataset

In [ ]:
# Challenge 1
# What was the average age of a person of Kenya?
#df.dtypes

df['Age_years'].unique()
df[df['Age_years'] == '80+'] = 80
df[df['Age_years'] == 'Age NS'] = 0
df['Age_years'].unique()
df.dtypes
df['Age_years'] = pd.to_numeric(df['Age_years'])
df.dtypes
df['Age_years'].mean()

39.5011894142135

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Float64Index: 20179 entries, 0.0 to nan
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   District     20179 non-null  object
 1   Urban/Rural  20178 non-null  object
 2   Age_years    20178 non-null  float64
 3   Male         20178 non-null  float64
 4   Female       20178 non-null  float64
 5   Total        20178 non-null  float64
 6   County       20178 non-null  object
 7   Province     20178 non-null  object
dtypes: float64(4), object(4)
memory usage: 1.4+ MB

In [ ]:
# Challenge 2
# What was the average female population in Kenya?
df['Female'].mean()

763.8725019669552

In [ ]:
# Challenge 3
# What was the average male population in Kenya?
#
df['Male'].mean()

755.0140833988985

In [ ]:
# Challenge 4
# Which 5 districts were the most densely populated Kenya in descending order?
#

#d_pop = df['Total'].groupby(df['District'])
#d_pop.sum().rank(ascending=0)

d = df.groupby('District')['Total']
d1 = d.sum()
d1.sort_values(ascending=False).head(5)

District
NAIROBI EAST     1141605
NAIROBI NORTH    1057449
NAIROBI WEST      682029
SIAYA             542587
MOLO              536814
Name: Total, dtype: int64

In [ ]:
# Challenge 5
# Which 5 counties were the most densely populated Counties in descending order?
# 
c = df.groupby('County')['Total']
c1 = c.sum()
c1.sort_values(ascending=False).head(5)

County
Nairobi     3126275
Kiambu      1655780
Kakamega    1645413
Nakuru      1589130
Meru        1567945
Name: Total, dtype: int64

In [ ]:
# Challenge 6
# Which 5 districts were the most sparsely populated in descending order?
# 


d_l = df.groupby('District')['Total']
d_l1 = d_l.sum()
d_l1.sort_values(ascending=True).head(5)

District
0                     0
80                24800
LAIKIPIA NORTH    32508
GARBATULLA        42571
MARSABIT          45827
Name: Total, dtype: int64

In [ ]:
# Challenge 7
# What was the average population of the the most densely populated county in Kenya?
# 

x = df.groupby('County')['Total']
x1 = x.mean()
x1 = x1.sort_values(ascending=False).head(1)
x1

County
Nairobi    9769.609375
Name: Total, dtype: float64

In [ ]:
# Challenge 8
# What was the average population of the the most sparsely populated county in Kenya?
# 

y = df.groupby('County')['Total']
y1 = y.mean()
y1 = y1.sort_values(ascending=True).head(1)
y1

County
0    0.0
Name: Total, dtype: float64

In [ ]:
# Challenge 9
# What was the total population of Busia County? 
# 

b = df.loc[df['County'] == 'Busia', 'Total'].sum()
b

737249

In [ ]:
# Challenge 10
# What was the average age of person in Busia County? How many people of this age were in Busia County?
# 

ba = df[df['County'] == 'Busia']

bage = ba['Age_years']
bage = pd.to_numeric(bage)
avB = (ba['Total']*bage).sum() / ba['Total'].sum()
avB

num = ba[ba['Age_years'] == '20']
num['Total'].sum()
#b['Age_years']
#bage
#a = df.loc[df['County'] == 'Busia', 'Age_years'].mean()
#a

17217

In [ ]:
# Challenge 11
# What was the Total population of Teso South District?
# 
Teso = df.loc[df['District'] == 'TESO SOUTH', 'Total' ].sum()
Teso

136998

In [ ]:
# Challenge 12
# What was the urban population of Teso South District?
# df.loc[(df.District == 'Teso South' & df.Urban/Rural == 'Urban')].groupby(df['Age_years']).mean()

Tso = df[df['District'] == 'TESO SOUTH']
Tso[Tso['Urban/Rural'] == 'Urban']['Total'].sum()

26059

In [ ]:
# Challenge 13
# What was the rural population of Teso South District?
# 
Tsr = df[df['District'] == 'TESO SOUTH']
Tsr[Tsr['Urban/Rural'] == 'Rural']['Total'].sum()

110939

In [ ]:
df.head()

              District Urban/Rural Age_years  ...    Total   County  Province
OBJECTID                                      ...
0.0       NAIROBI WEST       Urban         0  ...  20242.0  Nairobi   NAIROBI
1.0       NAIROBI WEST       Urban         1  ...  16113.0  Nairobi   NAIROBI
2.0       NAIROBI WEST       Urban         2  ...  17089.0  Nairobi   NAIROBI
3.0       NAIROBI WEST       Urban         3  ...  16754.0  Nairobi   NAIROBI
4.0       NAIROBI WEST       Urban         4  ...  15768.0  Nairobi   NAIROBI

[5 rows x 8 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Float64Index: 20179 entries, 0.0 to nan
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   District     20179 non-null  object
 1   Urban/Rural  20178 non-null  object
 2   Age_years    20178 non-null  object
 3   Male         20178 non-null  float64
 4   Female       20178 non-null  float64
 5   Total        20178 non-null  float64
 6   County       20178 non-null  object
 7   Province     20178 non-null  object
dtypes: float64(3), object(5)
memory usage: 1.4+ MB

In [ ]:
# Challenge 14
# What was the population of people aged 60 and above in Kenya?
#

#pop = df[df['Age_years'] >= '60']
#pop.sum()
df.loc[df['Age_years'] >= 60, 'Total'].sum()
#df['Age_years'].describe()

1123981.0

In [ ]:
# Challenge 15 
# What was the urban population in Kenya?
#
df.loc[df['Urban/Rural'] == 'Urban', 'Total'].sum()

12401054